Repository: tecogonaz0439/TCSameuraDamMonitor-apple
Catalog: TCSameuraDamMonitor/Localizable.xcstrings
Source language: en
Languages: ja

# settings.noStorageData
source: Storage Percentage Data Distribution Suspended
ja: 貯水率データ配信停止中

# settings.notificationDenied
source: Notification permission was denied. You can enable it in system settings.
ja: 通知の権限が拒否されました。システム設定で有効にできます。

# settings.otherMessages
source: Other Messages
ja: その他のメッセージ

# settings.resetAllMessages
source: Reset all storage percentage messages
ja: 全ての貯水率メッセージをリセット

# settings.resetAllOtherMessages
source: Reset all messages
ja: 全てのメッセージをリセット

# settings.resetOtherMessagesConfirmMessage
source: Reset all other messages? This action cannot be undone.
ja: 全てのメッセージをリセットしますか？この操作は元に戻せません。

# settings.resetOtherMessagesConfirmTitle
source: Other Messages
ja: その他のメッセージ

# settings.resetOptionDelete
source: Delete Messages
ja: メッセージを削除

# settings.resetOptionSameura
source: Set Messages for Udon Prefecture Residents
ja: うどん県民専用メッセージを設定

# settings.resetOtherStorageRateMessages
source: Reset all storage percentage messages
ja: 全ての貯水率メッセージをリセット

# settings.resetOtherStorageRateMessagesConfirmMessage
source: Reset all storage percentage messages? This action cannot be undone.
ja: 全ての貯水率メッセージをリセットしますか？この操作は元に戻せません。

# settings.resetOtherStorageRateMessagesConfirmTitle
source: Storage Percentage Messages
ja: 貯水率メッセージ

# settings.resetStorageRateMessagesNonJa
source: Set Messages for General Users
ja: 一般向けメッセージを設定

# settings.resetStorageRateMessagesConfirmMessage
source: Reset all storage percentage messages? This action cannot be undone.
ja: 全ての貯水率メッセージをリセットしますか？この操作は元に戻せません。

# settings.resetStorageRateMessagesConfirmTitle
source: Storage Percentage Messages
ja: 貯水率メッセージ

# settings.resetStorageRateMessagesPrompt
source: Please select a message
ja: メッセージを選択してください

# settings.resetStorageRateMessagesSameura
source: Udon Prefecture Resident Messages
ja: うどん県民専用メッセージ

# settings.showNotification
source: Show Notification
ja: 通知を表示する

# settings.showNotificationFooter
source: Displays a notification when observation data is fetched. Enabled only when a widget is added to the Home Screen or Lock Screen.
ja: 観測データ取得時に通知を表示します。ホーム画面とロック画面にウィジェットを追加した時のみ有効となります。

# settings.showNotificationFooterMacos
source: Displays a notification when observation data is fetched. Enabled only when a widget is added to the Home Screen.
ja: 観測データ取得時に通知を表示します。ホーム画面にウィジェットを追加した時のみ有効となります。

# settings.showStorageMessage
source: Show Storage Percentage Messages
ja: 貯水率メッセージを表示する

# settings.showStorageMessageDesc
source: Display messages based on the observation data storage rate.
ja: ダムの貯水率に応じたメッセージを表示します。

# settings.simulateLoadingFailure
source: Reproduce data load failure
ja: データ読込失敗を再現

# settings.simulateNetworkUnavailable
source: Reproduce network unavailable
ja: ネットワーク接続不可を再現

# settings.simulateNone
source: No simulation
ja: 再現しない

# settings.stateLabel
source: State
ja: 状態

# settings.storageMessagesOtherTitle
source: Storage Percentage Messages (Other Dams)
ja: 貯水率メッセージ(早明浦ダム以外)

# settings.storageMessagesSameuraTitle
source: Storage Percentage Messages (Sameura Dam)
ja: 貯水率メッセージ(早明浦ダム)

# settings.storageRate.sameura.0
source: Storage rate 0%
ja: 貯水率 0%

# settings.storageRate.sameura.0_20
source: Volume < 40,000×10³m³
ja: 貯水量 40,000×10³m³未満

# settings.storageRate.sameura.20_40
source: Volume ≥ 40,000×10³m³ and < 60,000×10³m³
ja: 貯水量 40,000×10³m³以上60,000×10³m³未満

# settings.storageRate.sameura.40_60
source: Volume ≥ 60,000×10³m³ and < 80,000×10³m³
ja: 貯水量 60,000×10³m³以上80,000×10³m³未満

# settings.storageRate.sameura.60_80
source: Volume ≥ 80,000×10³m³
ja: 貯水量 80,000×10³m³以上

# settings.storageRate.sameura.80_100
source: Storage rate 80-100%
ja: 貯水率 80-100%

# settings.systemAppSettings
source: App Settings
ja: アプリ設定(App Settings)

# settings.systemAppSettingsDesc
source: Open this app's system settings
ja: このアプリのシステム設定を開きます

# settings.systemAppSettingsFooter
source: Open this app's settings in the Settings app to configure notifications, language, and more.
ja: 設定アプリで、本アプリの設定を開きます。通知や言語の設定を行うことができます。 You can change the language of this app.

# settings.theme
source: Appearance
ja: 外観モード

# settings.themeDark
source: Dark
ja: ダーク

# settings.themeLight
source: Light
ja: ライト

# settings.themeSystem
source: Auto
ja: 自動

# settings.updateOnBoot
source: Update on device startup
ja: 端末起動時に更新する

# settings.updateOnBootFooter
source: Automatically fetches observation data on first app launch after device startup. Excluded if already auto-updated by the widget.
ja: 端末起動後、最初の本アプリ起動時に自動的に観測データを取得します。既にウィジェットで自動更新した場合は対象外とします。

# settings.updateOnBootFooterMacos
source: Automatically fetches observation data on first app launch after login. Excluded if already auto-updated by the widget.
ja: ログイン後、最初の本アプリ起動時に自動的に観測データを取得します。既にウィジェットで自動更新した場合は対象外とします。

# title.sudmonitorHistory
source: Past Data (Daily) Display
ja: 過去データ(日次)表示

# trend.down
source: Decreasing
ja: 低下

# trend.flat
source: Stable
ja: 横ばい

# trend.unknown
source: Unknown
ja: 不明

# trend.up
source: Increasing
ja: 上昇

# url.data
source: Realtime Dam Information, MLIT 国土交通省 リアルタイムダム諸量一覧表
ja: 国土交通省 リアルタイムダム諸量一覧表

# url.disaster
source: Disaster Information for River, MLIT 国土交通省 川の防災情報
ja: 国土交通省 川の防災情報

# url.search
source: Search Dam Data, MLIT 国土交通省 任意期間ダム諸量検索
ja: 国土交通省 任意期間ダム諸量検索

# url.siteInfo
source: Hydrological & Water Quality DB, MLIT 国土交通省 水文水質観測所情報
ja: 国土交通省 水文水質観測所情報
